using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lesson2
{
    internal class Program
    {
        static void Main(string[] args)
        /*
        1) Посчитать сумму всех трех цифр трехзначного числа, заданного константой (const). Вывести сумму на печать.
        Например:
        735 = 15 (7 + 3 + 5)


        2) Ввести с клавиатуры координаты выстрела x1 и y1. Записать в bool переменную логическое выражение, которое будет истинным (true) тогда и только тогда, когда этот выстрел попадает в круглую мишень (точка лежит внутри круга радиусом R). Вывести bool переменную на экран.
        Формула круга: x^2 + y^2 = R^2. Следовательно, условие нахождения точки ВНУТРИ круга будет... (подумайте о знаке сравнения). 
        Запись x^2 означает "икс в квадрате". 


        3) Пользователь вводить трехзначное число. Записать логическое условие, которые будет истинным тогда и только тогда, когда его средняя цифра меньше или равна (<=) первой (левой) и одновременно строго больше (>) последней (правой).
        Например: 
        742 (true)
        773 (true)
        755 (false)
        354 (false)
        335 (false)


        4) Ввести целое трехзначное число. Поменять местами его первую и последнюю цифры. Собрать новое число в новой переменной!
        Например:
        365 -> 563
        947 -> 749
        Вспоминаем арифметику... 365 это 3*100 + 6*10 + 5 :)


        5) Записать логическое условие, которое проверит, что в double числе нулевая дробная часть.
        Например:
        156.0 (true)
        156.2 (false)
        Подсказка: сравните само число double number и его явное приведение к (int)number
         */
        {

        }
    }
}
